doc/slides/slide_compilation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Compilation &amp; Directives de Préprocesseur</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Compilation &amp; Directives de Préprocesseur</h1><hr/>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Mécanismes de compilation</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<ol class="org-ol">
<li><p>
<b>Précompilation :</b> consiste à traiter, à <i>parser</i> les fichiers sources
avant compilation (résolution des directives de préprocesseur
<i>i.e.</i> remplacement de macros, suppression de texte, inclusion de
fichiers&#x2026;)
</p>

<div class="PROMPT">
<p>
g++ -E fichier_source.cc
</p>

</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Mécanismes de compilation</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<ol class="org-ol">
<li><b>Précompilation</b>
</li>
<li><p>
<b>Compilation séparée :</b> traduction du code en langage machine.
</p>
<div class="PROMPT">
<p>
g++ -c fichier_source.cc
</p>

</div>
<p>
Cette opération conduit à la création d&rsquo;un <b>fichier objet</b> d&rsquo;extension <code>.o</code>
(ici <code>fichier_source.o</code>).
</p>
</li>
</ol>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Mécanismes de compilation</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<ol class="org-ol">
<li><b>Précompilation</b>
</li>
<li><b>Compilation séparée</b>
</li>
<li><p>
<b>Édition de liens :</b> consiste à regrouper la totalité des données de même que
les fichiers objets et les bibliothèques (fonctions de la bibliothèque
standard et des autres bibliothèques externes) ainsi qu&rsquo;à résoudre les
références inter-fichiers.
</p>
<div class="PROMPT">
<p>
g++ fichier_source1.o fichier_source2.o&#x2026; -o&nbsp;fichier_executable
</p>

</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Mécanismes de compilation</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<ul class="org-ul">
<li><p>
Les trois précédentes étapes peuvent être réalisées en une seule opération via
la commande
</p>

<div class="CBOX">
<div class="PROMPT">
<p>
g++ fichier_source1.cc fichier_source2.cc&#x2026; -o&nbsp;fichier_executable
</p>

</div>

</div>
</li>

<li><p>
Le binaire ainsi généré <code>fichier_executable</code> peut alors être exécuté depuis le
répertoire local
</p>

<div class="CBOX">
<div class="PROMPT">
<p>
./fichier_executable
</p>

</div>

</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">Options de compilation</h2>
<div class="outline-text-2" id="text-unnumbered-5">
<ul class="org-ul">
<li><b>l&rsquo;option <code>-Ichemin</code></b> indique au compilateur où sont localisés les fichiers
d&rsquo;en-têtes nécessaires à la compilation séparée du programme. Par défaut, le
compilateur recherche ces fichiers localement et dans le répertoire
<code>/usr/include</code>,
</li>
</ul>

<ul class="org-ul">
<li><b>l&rsquo;option <code>-W</code></b> permet l&rsquo;activation des messages de mise en garde. Différents
niveaux sont accessibles, le plus complet étant <code>-Wall -Wextra</code>,
</li>
</ul>

<ul class="org-ul">
<li><b>l&rsquo;option <code>-Didentificateur</code></b> permet la définition d&rsquo;identificateur à fournir
lors du processus de précompilation. L&rsquo;activation des directives de
préprocesseur peut se faire par ce biais.
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-2">
<h2 id="unnumbered-6">Démystifier la command <code>ccc</code></h2>
<div class="outline-text-2" id="text-unnumbered-6">
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-2">
<h2 id="unnumbered-7">Directives de préprocesseur</h2>
<div class="outline-text-2" id="text-unnumbered-7">
<p>
Le préprocesseur recherche des directives de compilation repérées en début de
ligne par le symbole <code>#</code> et se terminant avec la fin de la ligne.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#directive</span> [param&#232;tre]
</pre>
</div>

<p>
Par exemple,
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#define</span> <span class="org-variable-name">PI</span> 3.141592
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-2">
<h2 id="unnumbered-8">Utilisation de directives de condition</h2>
<div class="outline-text-2" id="text-unnumbered-8">
<p>
Il est possible de contrôler ce qui sera compilé effectivement ou non, avec les
clauses de condition :
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span> condition
...
<span class="org-preprocessor">#endif</span>
</pre>
</div>

<p>
Le code compris dans la séquence <code>#if</code> &#x2013; <code>#endif</code> est considéré par le
compilateur seulement si la condition est vraie (non nulle).
</p>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-2">
<h2 id="unnumbered-9">Exemple (1/2)</h2>
<div class="outline-text-2" id="text-unnumbered-9">
<ul class="org-ul">
<li><p>
<b><code>test_debug.cc</code></b>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
<span class="org-preprocessor">#if</span> (DEBUG == 1)
  cout &lt;&lt; <span class="org-string">"DEBUG: "</span>
       &lt;&lt; <span class="org-string">"Mode debug du programme"</span> &lt;&lt; endl;
<span class="org-preprocessor">#else</span>
  cout &lt;&lt; <span class="org-string">"NOTICE: "</span>
       &lt;&lt; <span class="org-string">"Mode normal du programme"</span> &lt;&lt; endl;
<span class="org-preprocessor">#endif</span>
}
</pre>
</div>
</li>
</ul>

<p>
Compilation :
</p>
<div class="PROMPT">
<p>
g++ -DDEBUG=1 test_debug.cc -o test_debug
</p>

</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-2">
<h2 id="unnumbered-10">Exemple (2/2)</h2>
<div class="outline-text-2" id="text-unnumbered-10">
<ul class="org-ul">
<li><p>
<b><code>dummy.h</code></b>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> __dummy_h
<span class="org-preprocessor">#define</span> <span class="org-variable-name">__dummy_h</span> 1
<span class="org-type">void</span> <span class="org-function-name">dummy</span>();
<span class="org-preprocessor">#endif</span>
</pre>
</div>
</li>

<li><p>
<b><code>dummy.cc</code></b>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"dummy.h"</span>
<span class="org-type">void</span> <span class="org-function-name">dummy</span>() {}
</pre>
</div>
</li>

<li><p>
<b><code>test_dummy.cc</code></b>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"dummy.h"</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  dummy();
}
</pre>
</div>
</li>
</ul>

<p>
Compilation :
</p>
<div class="PROMPT">
<p>
g++ dummy.cc test_dummy.cc -o test_dummy
</p>

</div>
</div>
</div>
</div>
</body>
</html>
